page-practicals.org
#+Title: Practicals
#+Summary: Practicals
#+URL: practicals.html
#+Save_as: practicals.html
#+Sortorder: 015
#+Slug: practicals
#+OPTIONS: toc:nil num:nil html-postamble:nil

* Plan

The practicals are done in two parts:
- A *detailed analysis*, from raw reads to final results, of a dataset from a
  paper published in 2013: [[http://onlinelibrary.wiley.com/doi/10.1111/j.1365-294X.2012.05749.x/abstract][Molecular evolutionary and population genomic analysis of the 
  nine-spined stickleback using a modified restriction-site-associated DNA tag approach]]. 
  The raw dataset is available from the Dryad data archive, doi:
  [[http://dx.doi.org/10.5061/dryad.44sf1][10.5061/dryad.44sf1]]. We will try to *reproduce* the results from the paper,
  *criticize* the different steps and maybe *try different approaches* as we
  go.

  After this part, you should have a general view of a RAD-seq workflow.
- A *more specific look* at some precise steps of the analysis, using other
  published datasets. This might entail, for example, genotype calling using a
  maximum likelihood approach.

* Detailed instructions

During the practicals, we will be using an Etherpad document to share code. You
can access the Etherpad document [[https://etherpad.fr/p/1DAjASHRdI][here]].

Please follow the links to proceed to the detailed instructions:
- *[[file:part-one-01-introduction.html][Part one: a complete analysis, from raw reads to results]]*
  - [[file:part-one-01-introduction.html][Introduction]]
  - [[file:part-one-02-raw-reads-processing.html][Raw reads processing]]
  - [[file:part-one-03-de-novo-assembly.html][/De novo/ assembly]]
  - [[file:part-one-04-variant-calling-genotyping.html][Variant calling and genotyping]]
  - [[file:part-one-05-downstream-analysis.html][Downstream analysis]]
    - [[file:part-one-06-phylogeographic-tree.html][Phylogeographic tree]]
    - [[file:part-one-07-mapping-back-3sp-genome.html][Mapping back to the threespine genome]]
    - [[file:part-one-08-prediction-SNP-effect.html][Prediction of SNP effects in coding regions]]
    - [[file:part-one-09-genome-scan.html][Genome scan for G_{st}]]
    - [[file:part-one-10-GO-enrichment-tests.html][Gene ontology (GO) enrichment tests]]
  - [[file:part-one-11-conclusion.html][Conclusion]] 
- *[[file:part-two-01-introduction.html][Part two: going further for some analytical steps]]*

